<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"3b4524dd8c4c01c1f411817ebb0ca362e8c177aefbdd7992fc5d97a16c65f754","plan_job_ref":"Job Run Terraform plan in staging #288 at https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/15535382591","plan_out_hash":"0b415c5e258b957a849514cd6e178a8b5c2aa98210237930f9d8d9a60fa7a2bf","plan_hash":"fda453ea0b6c6e7f78968775d322a4a5638d4eee33c9a40dfefd9763bd5b1c20","plan_text_format":"diff","version":"2.0.1","closed":true} -->
Terraform plan in __terraform__
With var files: `terraform/staging.tfvars`
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # cloudfoundry_app.app will be updated in-place
!~  resource "cloudfoundry_app" "app" {
!~      created_at                  = "2025-05-05T21:44:14Z" -> (known after apply)
+       disk_quota                  = (known after apply)
+       health_check_type           = (known after apply)
!~      id                          = "************************************" -> (known after apply)
+       instances                   = (known after apply)
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = (known after apply)
        name                        = "continuous_monitoring-staging"
+       readiness_health_check_type = (known after apply)
!~      routes                      = [
-           {
-               protocol = "http1" -> null
-               route    = "continuous-monitoring-staging.app.cloud.gov" -> null
            },
-           {
-               protocol = "http1" -> null
-               route    = "rca-test.fr.cloud.gov" -> null
            },
        ] -> (known after apply)
!~      source_code_hash            = "1eEsFmP2+mAIIGKcYHUGPanHamAdxH0h4jxNH+fE03A=" -> "N4XX2v/7yH9VJ6+NTLg7fMoVXVaT3DBWN/COTzkF9pU="
!~      stack                       = "cflinuxfs4" -> (known after apply)
!~      updated_at                  = "2025-06-03T12:35:50Z" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # cloudfoundry_network_policy.egress_routing will be updated in-place
!~  resource "cloudfoundry_network_policy" "egress_routing" {
!~      policies = [
!~          {
!~              source_app      = "0ed3cb39-41d8-43d9-be32-fb12f7ac0e1b" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
!~          {
!~              source_app      = "0ed3cb39-41d8-43d9-be32-fb12f7ac0e1b" -> (known after apply)
#                (3 unchanged attributes hidden)
            },
        ]
    }

  # module.app_route[0].cloudfoundry_route.app_route will be updated in-place
!~  resource "cloudfoundry_route" "app_route" {
!~      destinations = [
-           {
-               app_id           = "0ed3cb39-41d8-43d9-be32-fb12f7ac0e1b" -> null
-               app_process_type = "web" -> null
-               id               = "93b25e7e-b8b8-45f6-b2f0-a30bb081f0b4" -> null
-               port             = 8080 -> null
-               protocol         = "http1" -> null
            },
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
        id           = "d95e9c29-36f0-40e3-b638-883317fe5200"
!~      updated_at   = "2025-05-09T16:45:34Z" -> (known after apply)
#        (6 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [Deploy Staging #114](https://github.com/GSA-TTS/continuous-assessment-poc/actions/runs/15535429878)